chcbaram/baram-nrf54-arduino/nrf54l/cores/nrf54l/nrf54l_pinmap.h
/*
 * nrf54l_pinmap.h — 핀↔신호 제약을 컴파일 타임에 검사한다
 * baram-nrf54l-arduino
 * SPDX-License-Identifier: MIT
 *
 * ⚠ **생성된 파일이다. 손으로 고치지 마라.**
 *   `extras/gen_pinmap.py` 가 Nordic Pin Planner 의 SoC 정의에서 굽는다:
 *   https://github.com/NordicPlayground/PinPlanner
 *
 * 표가 두 벌이고 칩 define 으로 고른다:
 *   nRF54L15   qfn52-6x6-qgaa          — P0, P1, P2, GPIO 35개
 *   nRF54LM20A fccsp98-3.67x3.85-paaa  — P0, P1, P2, P3, GPIO 66개  (NRF54LM20A_XXAA)
 * L05 / L10 / L15 는 제약이 **완전히 동일**하다 (JSON 을 비교해 확인).
 * LM20A 는 포트가 넷이고 도메인 20 이 P1·P3 를 함께 소유한다.
 *
 * ── 왜 필요한가 ───────────────────────────────────────────────────────
 *
 * `nrf54l_domains.h` 는 **포트**까지만 본다. 그것만으로는 부족하다:
 *
 *   PIN_SPI_SCK = P2.03   → 포트 검사는 통과한다 (P2 가 맞으니까)
 *                         → 그런데 SPIM00.SCK 는 P2.01·P2.06 뿐이라 동작하지 않는다
 *                         → 증상은 "SPI 가 안 된다" 뿐이고 원인이 안 보인다
 *
 * 이 헤더는 그 배정을 **빌드에서 막는다.** 오류 메시지가 쓸 수 있는 핀을 알려 준다.
 *
 * ── 쓰는 법 ───────────────────────────────────────────────────────────
 *
 *   NRF54L_ASSERT_SIG(PIN_SPI_SCK, SPIM00_SCK, "SPI SCK");
 *
 * 신호 이름은 `libraries/PinMap` 의 예제 주석 표에 있는 것 그대로다.
 * `SPIM/SPIS00` 처럼 묶여 있는 것은 `SPIM00` 과 `SPIS00` 둘 다 받는다.
 *
 * ⚠ **핀은 매크로로 넘겨라.** variant 의 `static const uint8_t D6 = ...` 같은
 *   Arduino 관용 별칭은 **C 에서 상수식이 아니라** _Static_assert 에 못 넣는다.
 *   variant.h 는 코어의 .c 들에서도 include 되므로 C 로도 컴파일된다.
 *   `_PINNUM(2, 8)` 이나 `PIN_xxx` 매크로를 써라.
 */
#ifndef _NRF54L_PINMAP_H_
#define _NRF54L_PINMAP_H_

#include "nrf54l_domains.h"

/**
 * 핀이 그 신호로 갈 수 있는지 컴파일 타임에 검사한다.
 *
 * @param pin   variant 의 핀 매크로 (절대 GPIO 번호)
 * @param sig   신호 이름 — 예: SPIM00_SCK, TWIM22_SDA, SAADC_AIN0
 * @param what  오류 메시지에 넣을 설명
 */
#define NRF54L_ASSERT_SIG(pin, sig, what)     NRF54L_STATIC_ASSERT(NRF54L_SIG_##sig(pin), what " : " NRF54L_TXT_##sig)

#if defined(NRF54LM20A_XXAA)

#define NRF54L_SIG_SPIM00_SCK(p)  ((p) == 65 || (p) == 70)
#define NRF54L_TXT_SPIM00_SCK     "SPIM/SPIS00.SCK only works on P2.01, P2.06"
#define NRF54L_SIG_SPIS00_SCK(p)  ((p) == 65 || (p) == 70)
#define NRF54L_TXT_SPIS00_SCK     "SPIM/SPIS00.SCK only works on P2.01, P2.06"

#define NRF54L_SIG_SPIM00_SDO(p)  ((p) == 66 || (p) == 72)
#define NRF54L_TXT_SPIM00_SDO     "SPIM/SPIS00.SDO only works on P2.02, P2.08"
#define NRF54L_SIG_SPIS00_SDO(p)  ((p) == 66 || (p) == 72)
#define NRF54L_TXT_SPIS00_SDO     "SPIM/SPIS00.SDO only works on P2.02, P2.08"

#define NRF54L_SIG_SPIM00_SDI(p)  ((p) == 68 || (p) == 73)
#define NRF54L_TXT_SPIM00_SDI     "SPIM/SPIS00.SDI only works on P2.04, P2.09"
#define NRF54L_SIG_SPIS00_SDI(p)  ((p) == 68 || (p) == 73)
#define NRF54L_TXT_SPIS00_SDI     "SPIM/SPIS00.SDI only works on P2.04, P2.09"

#define NRF54L_SIG_SPIM00_CSN(p)  ((p) == 69 || (p) == 74)
#define NRF54L_TXT_SPIM00_CSN     "SPIM/SPIS00.CSN only works on P2.05, P2.10"
#define NRF54L_SIG_SPIS00_CSN(p)  ((p) == 69 || (p) == 74)
#define NRF54L_TXT_SPIS00_CSN     "SPIM/SPIS00.CSN only works on P2.05, P2.10"

#define NRF54L_SIG_SPIM00_DCX(p)  ((p) == 64 || (p) == 71)
#define NRF54L_TXT_SPIM00_DCX     "SPIM/SPIS00.DCX only works on P2.00, P2.07"
#define NRF54L_SIG_SPIS00_DCX(p)  ((p) == 64 || (p) == 71)
#define NRF54L_TXT_SPIS00_DCX     "SPIM/SPIS00.DCX only works on P2.00, P2.07"

#define NRF54L_SIG_UARTE00_TXD(p)  ((p) == 66 || (p) == 72)
#define NRF54L_TXT_UARTE00_TXD     "UARTE00.TXD only works on P2.02, P2.08"

#define NRF54L_SIG_UARTE00_RXD(p)  ((p) == 64 || (p) == 71)
#define NRF54L_TXT_UARTE00_RXD     "UARTE00.RXD only works on P2.00, P2.07"

#define NRF54L_SIG_UARTE00_CTS(p)  ((p) == 68 || (p) == 73)
#define NRF54L_TXT_UARTE00_CTS     "UARTE00.CTS only works on P2.04, P2.09"

#define NRF54L_SIG_UARTE00_RTS(p)  ((p) == 69 || (p) == 74)
#define NRF54L_TXT_UARTE00_RTS     "UARTE00.RTS only works on P2.05, P2.10"

#define NRF54L_SIG_QSPI_SCK(p)  ((p) == 65)
#define NRF54L_TXT_QSPI_SCK     "QSPI.SCK only works on P2.01"

#define NRF54L_SIG_QSPI_CSN(p)  ((p) == 69)
#define NRF54L_TXT_QSPI_CSN     "QSPI.CSN only works on P2.05"

#define NRF54L_SIG_QSPI_D0(p)  ((p) == 66)
#define NRF54L_TXT_QSPI_D0     "QSPI.D0 only works on P2.02"

#define NRF54L_SIG_QSPI_D1(p)  ((p) == 68)
#define NRF54L_TXT_QSPI_D1     "QSPI.D1 only works on P2.04"

#define NRF54L_SIG_QSPI_D2(p)  ((p) == 67)
#define NRF54L_TXT_QSPI_D2     "QSPI.D2 only works on P2.03"

#define NRF54L_SIG_QSPI_D3(p)  ((p) == 64)
#define NRF54L_TXT_QSPI_D3     "QSPI.D3 only works on P2.00"

#define NRF54L_SIG_RADIO_RADIO_0(p)  ((p) == 47)
#define NRF54L_TXT_RADIO_RADIO_0     "RADIO.RADIO[0] only works on P1.15"

#define NRF54L_SIG_RADIO_RADIO_1(p)  ((p) == 48)
#define NRF54L_TXT_RADIO_RADIO_1     "RADIO.RADIO[1] only works on P1.16"

#define NRF54L_SIG_RADIO_RADIO_3(p)  ((p) == 50)
#define NRF54L_TXT_RADIO_RADIO_3     "RADIO.RADIO[3] only works on P1.18"

#define NRF54L_SIG_RADIO_RADIO_4(p)  ((p) == 51)
#define NRF54L_TXT_RADIO_RADIO_4     "RADIO.RADIO[4] only works on P1.19"

#define NRF54L_SIG_RADIO_RADIO_5(p)  ((p) == 52)
#define NRF54L_TXT_RADIO_RADIO_5     "RADIO.RADIO[5] only works on P1.20"

#define NRF54L_SIG_RADIO_RADIO_6(p)  ((p) == 53)
#define NRF54L_TXT_RADIO_RADIO_6     "RADIO.RADIO[6] only works on P1.21"

#define NRF54L_SIG_PWM20_CHAN_0(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM20_CHAN_0     "PWM20.CHAN[0] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PWM20_CHAN_1(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM20_CHAN_1     "PWM20.CHAN[1] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PWM20_CHAN_2(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM20_CHAN_2     "PWM20.CHAN[2] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PWM20_CHAN_3(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM20_CHAN_3     "PWM20.CHAN[3] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PWM21_CHAN_0(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM21_CHAN_0     "PWM21.CHAN[0] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PWM21_CHAN_1(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM21_CHAN_1     "PWM21.CHAN[1] only works on any pin on P1, any pin on P3"

