chcbaram/baram-nrf54-arduino/nrf54l/cores/nrf54l/nrf54l_pinmap.h
#define NRF54L_SIG_PWM21_CHAN_2(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM21_CHAN_2     "PWM21.CHAN[2] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PWM21_CHAN_3(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM21_CHAN_3     "PWM21.CHAN[3] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PWM22_CHAN_0(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM22_CHAN_0     "PWM22.CHAN[0] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PWM22_CHAN_1(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM22_CHAN_1     "PWM22.CHAN[1] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PWM22_CHAN_2(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM22_CHAN_2     "PWM22.CHAN[2] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PWM22_CHAN_3(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_PWM22_CHAN_3     "PWM22.CHAN[3] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SAADC_AIN0(p)  ((p) == 32)
#define NRF54L_TXT_SAADC_AIN0     "SAADC.AIN0 only works on P1.00"

#define NRF54L_SIG_SAADC_AIN1(p)  ((p) == 63)
#define NRF54L_TXT_SAADC_AIN1     "SAADC.AIN1 only works on P1.31"

#define NRF54L_SIG_SAADC_AIN2(p)  ((p) == 62)
#define NRF54L_TXT_SAADC_AIN2     "SAADC.AIN2 only works on P1.30"

#define NRF54L_SIG_SAADC_AIN3(p)  ((p) == 61)
#define NRF54L_TXT_SAADC_AIN3     "SAADC.AIN3 only works on P1.29"

#define NRF54L_SIG_SAADC_AIN4(p)  ((p) == 38)
#define NRF54L_TXT_SAADC_AIN4     "SAADC.AIN4 only works on P1.06"

#define NRF54L_SIG_SAADC_AIN5(p)  ((p) == 37)
#define NRF54L_TXT_SAADC_AIN5     "SAADC.AIN5 only works on P1.05"

#define NRF54L_SIG_SAADC_AIN6(p)  ((p) == 36)
#define NRF54L_TXT_SAADC_AIN6     "SAADC.AIN6 only works on P1.04"

#define NRF54L_SIG_SAADC_AIN7(p)  ((p) == 35)
#define NRF54L_TXT_SAADC_AIN7     "SAADC.AIN7 only works on P1.03"

#define NRF54L_SIG_SAADC_EXTREF(p)  ((p) == 39)
#define NRF54L_TXT_SAADC_EXTREF     "SAADC.EXTREF only works on P1.07"

#define NRF54L_SIG_NFCT_NFC1(p)  ((p) == 33)
#define NRF54L_TXT_NFCT_NFC1     "NFCT.NFC1 only works on P1.01"

#define NRF54L_SIG_NFCT_NFC2(p)  ((p) == 34)
#define NRF54L_TXT_NFCT_NFC2     "NFCT.NFC2 only works on P1.02"

#define NRF54L_SIG_TAMPC_ASO_0(p)  ((p) == 37)
#define NRF54L_TXT_TAMPC_ASO_0     "TAMPC.ASO[0] only works on P1.05"

#define NRF54L_SIG_TAMPC_ASI_0(p)  ((p) == 38)
#define NRF54L_TXT_TAMPC_ASI_0     "TAMPC.ASI[0] only works on P1.06"

#define NRF54L_SIG_TAMPC_ASO_1(p)  ((p) == 40)
#define NRF54L_TXT_TAMPC_ASO_1     "TAMPC.ASO[1] only works on P1.08"

#define NRF54L_SIG_TAMPC_ASI_1(p)  ((p) == 41)
#define NRF54L_TXT_TAMPC_ASI_1     "TAMPC.ASI[1] only works on P1.09"

#define NRF54L_SIG_TAMPC_ASO_2(p)  ((p) == 47)
#define NRF54L_TXT_TAMPC_ASO_2     "TAMPC.ASO[2] only works on P1.15"

#define NRF54L_SIG_TAMPC_ASI_2(p)  ((p) == 48)
#define NRF54L_TXT_TAMPC_ASI_2     "TAMPC.ASI[2] only works on P1.16"

#define NRF54L_SIG_GRTC_PWM(p)  ((p) == 3)
#define NRF54L_TXT_GRTC_PWM     "GRTC.PWM only works on P0.03"

#define NRF54L_SIG_GRTC_CLKOUT32K(p)  ((p) == 4)
#define NRF54L_TXT_GRTC_CLKOUT32K     "GRTC.CLKOUT32K only works on P0.04"

#define NRF54L_SIG_GRTC_CLKOUTFAST(p)  ((p) == 39)
#define NRF54L_TXT_GRTC_CLKOUTFAST     "GRTC.CLKOUTFAST only works on P1.07"

#define NRF54L_SIG_LFXO_XL1(p)  ((p) == 52)
#define NRF54L_TXT_LFXO_XL1     "LFXO.XL1 only works on P1.20"

#define NRF54L_SIG_LFXO_XL2(p)  ((p) == 53)
#define NRF54L_TXT_LFXO_XL2     "LFXO.XL2 only works on P1.21"

#define NRF54L_SIG_GPIOTE20_CHAN_0(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_GPIOTE20_CHAN_0     "GPIOTE20.CHAN[0] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_GPIOTE20_CHAN_1(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_GPIOTE20_CHAN_1     "GPIOTE20.CHAN[1] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_GPIOTE20_CHAN_2(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_GPIOTE20_CHAN_2     "GPIOTE20.CHAN[2] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_GPIOTE20_CHAN_3(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_GPIOTE20_CHAN_3     "GPIOTE20.CHAN[3] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_GPIOTE20_CHAN_4(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_GPIOTE20_CHAN_4     "GPIOTE20.CHAN[4] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_GPIOTE20_CHAN_5(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_GPIOTE20_CHAN_5     "GPIOTE20.CHAN[5] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_GPIOTE20_CHAN_6(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_GPIOTE20_CHAN_6     "GPIOTE20.CHAN[6] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_GPIOTE20_CHAN_7(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_GPIOTE20_CHAN_7     "GPIOTE20.CHAN[7] only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_GPIOTE30_CHAN_0(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_GPIOTE30_CHAN_0     "GPIOTE30.CHAN[0] only works on any pin on P0"

#define NRF54L_SIG_GPIOTE30_CHAN_1(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_GPIOTE30_CHAN_1     "GPIOTE30.CHAN[1] only works on any pin on P0"

#define NRF54L_SIG_GPIOTE30_CHAN_2(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_GPIOTE30_CHAN_2     "GPIOTE30.CHAN[2] only works on any pin on P0"

#define NRF54L_SIG_GPIOTE30_CHAN_3(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_GPIOTE30_CHAN_3     "GPIOTE30.CHAN[3] only works on any pin on P0"

#define NRF54L_SIG_SPIM30_SCK(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIM30_SCK     "SPIM/SPIS30.SCK only works on any pin on P0"
#define NRF54L_SIG_SPIS30_SCK(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIS30_SCK     "SPIM/SPIS30.SCK only works on any pin on P0"

#define NRF54L_SIG_SPIM30_SDO(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIM30_SDO     "SPIM/SPIS30.SDO only works on any pin on P0"
#define NRF54L_SIG_SPIS30_SDO(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIS30_SDO     "SPIM/SPIS30.SDO only works on any pin on P0"

#define NRF54L_SIG_SPIM30_SDI(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIM30_SDI     "SPIM/SPIS30.SDI only works on any pin on P0"
#define NRF54L_SIG_SPIS30_SDI(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIS30_SDI     "SPIM/SPIS30.SDI only works on any pin on P0"

#define NRF54L_SIG_SPIM30_CSN(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIM30_CSN     "SPIM/SPIS30.CSN only works on any pin on P0"
#define NRF54L_SIG_SPIS30_CSN(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIS30_CSN     "SPIM/SPIS30.CSN only works on any pin on P0"

#define NRF54L_SIG_SPIM30_DCX(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIM30_DCX     "SPIM/SPIS30.DCX only works on any pin on P0"
#define NRF54L_SIG_SPIS30_DCX(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIS30_DCX     "SPIM/SPIS30.DCX only works on any pin on P0"

#define NRF54L_SIG_TWIM30_SCL(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_TWIM30_SCL     "TWIM/TWIS30.SCL only works on any pin on P0"
#define NRF54L_SIG_TWIS30_SCL(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_TWIS30_SCL     "TWIM/TWIS30.SCL only works on any pin on P0"

