chcbaram/baram-nrf54-arduino/nrf54l/cores/nrf54l/nrf54l_pinmap.h
#define NRF54L_SIG_TWIM30_SDA(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_TWIM30_SDA     "TWIM/TWIS30.SDA only works on any pin on P0"
#define NRF54L_SIG_TWIS30_SDA(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_TWIS30_SDA     "TWIM/TWIS30.SDA only works on any pin on P0"

#define NRF54L_SIG_UARTE30_TXD(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_UARTE30_TXD     "UARTE30.TXD only works on any pin on P0"

#define NRF54L_SIG_UARTE30_RXD(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_UARTE30_RXD     "UARTE30.RXD only works on any pin on P0"

#define NRF54L_SIG_UARTE30_CTS(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_UARTE30_CTS     "UARTE30.CTS only works on any pin on P0"

#define NRF54L_SIG_UARTE30_RTS(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_UARTE30_RTS     "UARTE30.RTS only works on any pin on P0"

#define NRF54L_SIG_SPIM20_SCK(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM20_SCK     "SPIM/SPIS20.SCK only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS20_SCK(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS20_SCK     "SPIM/SPIS20.SCK only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM20_SDO(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM20_SDO     "SPIM/SPIS20.SDO only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS20_SDO(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS20_SDO     "SPIM/SPIS20.SDO only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM20_SDI(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM20_SDI     "SPIM/SPIS20.SDI only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS20_SDI(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS20_SDI     "SPIM/SPIS20.SDI only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM20_CSN(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM20_CSN     "SPIM/SPIS20.CSN only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS20_CSN(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS20_CSN     "SPIM/SPIS20.CSN only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM20_DCX(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM20_DCX     "SPIM/SPIS20.DCX only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS20_DCX(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS20_DCX     "SPIM/SPIS20.DCX only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_TWIM20_SCL(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIM20_SCL     "TWIM/TWIS20.SCL only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_TWIS20_SCL(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIS20_SCL     "TWIM/TWIS20.SCL only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_TWIM20_SDA(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIM20_SDA     "TWIM/TWIS20.SDA only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_TWIS20_SDA(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIS20_SDA     "TWIM/TWIS20.SDA only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE20_TXD(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE20_TXD     "UARTE20.TXD only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE20_RXD(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE20_RXD     "UARTE20.RXD only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE20_CTS(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE20_CTS     "UARTE20.CTS only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE20_RTS(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE20_RTS     "UARTE20.RTS only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM21_SCK(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM21_SCK     "SPIM/SPIS21.SCK only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS21_SCK(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS21_SCK     "SPIM/SPIS21.SCK only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM21_SDO(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM21_SDO     "SPIM/SPIS21.SDO only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS21_SDO(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS21_SDO     "SPIM/SPIS21.SDO only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM21_SDI(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM21_SDI     "SPIM/SPIS21.SDI only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS21_SDI(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS21_SDI     "SPIM/SPIS21.SDI only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM21_CSN(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM21_CSN     "SPIM/SPIS21.CSN only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS21_CSN(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS21_CSN     "SPIM/SPIS21.CSN only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM21_DCX(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM21_DCX     "SPIM/SPIS21.DCX only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS21_DCX(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS21_DCX     "SPIM/SPIS21.DCX only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_TWIM21_SCL(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIM21_SCL     "TWIM/TWIS21.SCL only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_TWIS21_SCL(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIS21_SCL     "TWIM/TWIS21.SCL only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_TWIM21_SDA(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIM21_SDA     "TWIM/TWIS21.SDA only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_TWIS21_SDA(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIS21_SDA     "TWIM/TWIS21.SDA only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE21_TXD(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE21_TXD     "UARTE21.TXD only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE21_RXD(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE21_RXD     "UARTE21.RXD only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE21_CTS(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE21_CTS     "UARTE21.CTS only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE21_RTS(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE21_RTS     "UARTE21.RTS only works on any pin on P1, any pin on P3"

