chcbaram/baram-nrf54-arduino/nrf54l/cores/nrf54l/nrf54l_pinmap.h
#define NRF54L_SIG_SPIM22_SCK(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM22_SCK     "SPIM/SPIS22.SCK only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS22_SCK(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS22_SCK     "SPIM/SPIS22.SCK only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM22_SDO(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM22_SDO     "SPIM/SPIS22.SDO only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS22_SDO(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS22_SDO     "SPIM/SPIS22.SDO only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM22_SDI(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM22_SDI     "SPIM/SPIS22.SDI only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS22_SDI(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS22_SDI     "SPIM/SPIS22.SDI only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM22_CSN(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM22_CSN     "SPIM/SPIS22.CSN only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS22_CSN(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS22_CSN     "SPIM/SPIS22.CSN only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM22_DCX(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM22_DCX     "SPIM/SPIS22.DCX only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS22_DCX(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS22_DCX     "SPIM/SPIS22.DCX only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_TWIM22_SCL(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIM22_SCL     "TWIM/TWIS22.SCL only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_TWIS22_SCL(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIS22_SCL     "TWIM/TWIS22.SCL only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_TWIM22_SDA(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIM22_SDA     "TWIM/TWIS22.SDA only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_TWIS22_SDA(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIS22_SDA     "TWIM/TWIS22.SDA only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE22_TXD(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE22_TXD     "UARTE22.TXD only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE22_RXD(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE22_RXD     "UARTE22.RXD only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE22_CTS(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE22_CTS     "UARTE22.CTS only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE22_RTS(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE22_RTS     "UARTE22.RTS only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM23_SCK(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM23_SCK     "SPIM/SPIS23.SCK only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS23_SCK(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS23_SCK     "SPIM/SPIS23.SCK only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM23_SDO(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM23_SDO     "SPIM/SPIS23.SDO only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS23_SDO(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS23_SDO     "SPIM/SPIS23.SDO only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM23_SDI(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM23_SDI     "SPIM/SPIS23.SDI only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS23_SDI(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS23_SDI     "SPIM/SPIS23.SDI only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM23_CSN(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM23_CSN     "SPIM/SPIS23.CSN only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS23_CSN(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS23_CSN     "SPIM/SPIS23.CSN only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM23_DCX(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM23_DCX     "SPIM/SPIS23.DCX only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS23_DCX(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS23_DCX     "SPIM/SPIS23.DCX only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_TWIM23_SCL(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIM23_SCL     "TWIM/TWIS23.SCL only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_TWIS23_SCL(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIS23_SCL     "TWIM/TWIS23.SCL only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_TWIM23_SDA(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIM23_SDA     "TWIM/TWIS23.SDA only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_TWIS23_SDA(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIS23_SDA     "TWIM/TWIS23.SDA only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE23_TXD(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE23_TXD     "UARTE23.TXD only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE23_RXD(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE23_RXD     "UARTE23.RXD only works on any pin on P1, any pin on P3"

