chcbaram/baram-nrf54-arduino/nrf54l/cores/nrf54l/nrf54l_pinmap.h
#define NRF54L_SIG_UARTE23_CTS(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE23_CTS     "UARTE23.CTS only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE23_RTS(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE23_RTS     "UARTE23.RTS only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM24_SCK(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM24_SCK     "SPIM/SPIS24.SCK only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS24_SCK(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS24_SCK     "SPIM/SPIS24.SCK only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM24_SDO(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM24_SDO     "SPIM/SPIS24.SDO only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS24_SDO(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS24_SDO     "SPIM/SPIS24.SDO only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM24_SDI(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM24_SDI     "SPIM/SPIS24.SDI only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS24_SDI(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS24_SDI     "SPIM/SPIS24.SDI only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM24_CSN(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM24_CSN     "SPIM/SPIS24.CSN only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS24_CSN(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS24_CSN     "SPIM/SPIS24.CSN only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_SPIM24_DCX(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIM24_DCX     "SPIM/SPIS24.DCX only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_SPIS24_DCX(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_SPIS24_DCX     "SPIM/SPIS24.DCX only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_TWIM24_SCL(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIM24_SCL     "TWIM/TWIS24.SCL only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_TWIS24_SCL(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIS24_SCL     "TWIM/TWIS24.SCL only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_TWIM24_SDA(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIM24_SDA     "TWIM/TWIS24.SDA only works on any pin on P1, any pin on P3"
#define NRF54L_SIG_TWIS24_SDA(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_TWIS24_SDA     "TWIM/TWIS24.SDA only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE24_TXD(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE24_TXD     "UARTE24.TXD only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE24_RXD(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE24_RXD     "UARTE24.RXD only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE24_CTS(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE24_CTS     "UARTE24.CTS only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_UARTE24_RTS(p)  (NRF54L_PORT_OF(p) == 1 || NRF54L_PORT_OF(p) == 3)
#define NRF54L_TXT_UARTE24_RTS     "UARTE24.RTS only works on any pin on P1, any pin on P3"

#define NRF54L_SIG_PDM20_CLK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PDM20_CLK     "PDM20.CLK only works on any pin on P1"

#define NRF54L_SIG_PDM20_DIN(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PDM20_DIN     "PDM20.DIN only works on any pin on P1"

#define NRF54L_SIG_PDM21_CLK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PDM21_CLK     "PDM21.CLK only works on any pin on P1"

#define NRF54L_SIG_PDM21_DIN(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PDM21_DIN     "PDM21.DIN only works on any pin on P1"

#define NRF54L_SIG_TDM_MCK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TDM_MCK     "TDM.MCK only works on any pin on P1"

#define NRF54L_SIG_TDM_SCK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TDM_SCK     "TDM.SCK only works on any pin on P1"

#define NRF54L_SIG_TDM_FSYNC(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TDM_FSYNC     "TDM.FSYNC only works on any pin on P1"

#define NRF54L_SIG_TDM_SDIN(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TDM_SDIN     "TDM.SDIN only works on any pin on P1"

#define NRF54L_SIG_TDM_SDOUT(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TDM_SDOUT     "TDM.SDOUT only works on any pin on P1"

#define NRF54L_SIG_QDEC20_A(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC20_A     "QDEC20.A only works on any pin on P1"

#define NRF54L_SIG_QDEC20_B(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC20_B     "QDEC20.B only works on any pin on P1"

#define NRF54L_SIG_QDEC20_LED(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC20_LED     "QDEC20.LED only works on any pin on P1"

#define NRF54L_SIG_QDEC21_A(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC21_A     "QDEC21.A only works on any pin on P1"

#define NRF54L_SIG_QDEC21_B(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC21_B     "QDEC21.B only works on any pin on P1"

#define NRF54L_SIG_QDEC21_LED(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC21_LED     "QDEC21.LED only works on any pin on P1"

#else /* nRF54L05 / L10 / L15 */

#define NRF54L_SIG_SPIM00_SCK(p)  ((p) == 65 || (p) == 70)
#define NRF54L_TXT_SPIM00_SCK     "SPIM/SPIS00.SCK only works on P2.01, P2.06"
#define NRF54L_SIG_SPIS00_SCK(p)  ((p) == 65 || (p) == 70)
#define NRF54L_TXT_SPIS00_SCK     "SPIM/SPIS00.SCK only works on P2.01, P2.06"

#define NRF54L_SIG_SPIM00_SDO(p)  ((p) == 66 || (p) == 72)
#define NRF54L_TXT_SPIM00_SDO     "SPIM/SPIS00.SDO only works on P2.02, P2.08"
#define NRF54L_SIG_SPIS00_SDO(p)  ((p) == 66 || (p) == 72)
#define NRF54L_TXT_SPIS00_SDO     "SPIM/SPIS00.SDO only works on P2.02, P2.08"

#define NRF54L_SIG_SPIM00_SDI(p)  ((p) == 68 || (p) == 73)
#define NRF54L_TXT_SPIM00_SDI     "SPIM/SPIS00.SDI only works on P2.04, P2.09"
#define NRF54L_SIG_SPIS00_SDI(p)  ((p) == 68 || (p) == 73)
#define NRF54L_TXT_SPIS00_SDI     "SPIM/SPIS00.SDI only works on P2.04, P2.09"

#define NRF54L_SIG_SPIM00_CS(p)  ((p) == 69 || (p) == 74)
#define NRF54L_TXT_SPIM00_CS     "SPIM/SPIS00.CS only works on P2.05, P2.10"
#define NRF54L_SIG_SPIS00_CS(p)  ((p) == 69 || (p) == 74)
#define NRF54L_TXT_SPIS00_CS     "SPIM/SPIS00.CS only works on P2.05, P2.10"

#define NRF54L_SIG_SPIM00_DCX(p)  ((p) == 64 || (p) == 71)
#define NRF54L_TXT_SPIM00_DCX     "SPIM/SPIS00.DCX only works on P2.00, P2.07"
#define NRF54L_SIG_SPIS00_DCX(p)  ((p) == 64 || (p) == 71)
#define NRF54L_TXT_SPIS00_DCX     "SPIM/SPIS00.DCX only works on P2.00, P2.07"

