chcbaram/baram-nrf54-arduino/nrf54l/cores/nrf54l/nrf54l_pinmap.h
#define NRF54L_SIG_UARTE00_TXD(p)  ((p) == 66 || (p) == 72)
#define NRF54L_TXT_UARTE00_TXD     "UARTE00.TXD only works on P2.02, P2.08"

#define NRF54L_SIG_UARTE00_RXD(p)  ((p) == 64 || (p) == 71)
#define NRF54L_TXT_UARTE00_RXD     "UARTE00.RXD only works on P2.00, P2.07"

#define NRF54L_SIG_UARTE00_CTS(p)  ((p) == 68 || (p) == 73)
#define NRF54L_TXT_UARTE00_CTS     "UARTE00.CTS only works on P2.04, P2.09"

#define NRF54L_SIG_UARTE00_RTS(p)  ((p) == 69 || (p) == 74)
#define NRF54L_TXT_UARTE00_RTS     "UARTE00.RTS only works on P2.05, P2.10"

#define NRF54L_SIG_RADIO_RADIO_0(p)  ((p) == 41)
#define NRF54L_TXT_RADIO_RADIO_0     "RADIO.RADIO[0] only works on P1.09"

#define NRF54L_SIG_RADIO_RADIO_1(p)  ((p) == 42)
#define NRF54L_TXT_RADIO_RADIO_1     "RADIO.RADIO[1] only works on P1.10"

#define NRF54L_SIG_RADIO_RADIO_2(p)  ((p) == 43)
#define NRF54L_TXT_RADIO_RADIO_2     "RADIO.RADIO[2] only works on P1.11"

#define NRF54L_SIG_RADIO_RADIO_3(p)  ((p) == 44)
#define NRF54L_TXT_RADIO_RADIO_3     "RADIO.RADIO[3] only works on P1.12"

#define NRF54L_SIG_RADIO_RADIO_4(p)  ((p) == 45)
#define NRF54L_TXT_RADIO_RADIO_4     "RADIO.RADIO[4] only works on P1.13"

#define NRF54L_SIG_RADIO_RADIO_5(p)  ((p) == 46)
#define NRF54L_TXT_RADIO_RADIO_5     "RADIO.RADIO[5] only works on P1.14"

#define NRF54L_SIG_RADIO_RADIO_6(p)  ((p) == 37)
#define NRF54L_TXT_RADIO_RADIO_6     "RADIO.RADIO[6] only works on P1.05"

#define NRF54L_SIG_SPIM20_SCK(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 65)
#define NRF54L_TXT_SPIM20_SCK     "SPIM/SPIS20.SCK only works on any pin on P1, P2.01"
#define NRF54L_SIG_SPIS20_SCK(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 65)
#define NRF54L_TXT_SPIS20_SCK     "SPIM/SPIS20.SCK only works on any pin on P1, P2.01"

#define NRF54L_SIG_SPIM20_SDO(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 66)
#define NRF54L_TXT_SPIM20_SDO     "SPIM/SPIS20.SDO only works on any pin on P1, P2.02"
#define NRF54L_SIG_SPIS20_SDO(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 66)
#define NRF54L_TXT_SPIS20_SDO     "SPIM/SPIS20.SDO only works on any pin on P1, P2.02"

#define NRF54L_SIG_SPIM20_SDI(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 68)
#define NRF54L_TXT_SPIM20_SDI     "SPIM/SPIS20.SDI only works on any pin on P1, P2.04"
#define NRF54L_SIG_SPIS20_SDI(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 68)
#define NRF54L_TXT_SPIS20_SDI     "SPIM/SPIS20.SDI only works on any pin on P1, P2.04"

#define NRF54L_SIG_SPIM20_CS(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 69)
#define NRF54L_TXT_SPIM20_CS     "SPIM/SPIS20.CS only works on any pin on P1, P2.05"
#define NRF54L_SIG_SPIS20_CS(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 69)
#define NRF54L_TXT_SPIS20_CS     "SPIM/SPIS20.CS only works on any pin on P1, P2.05"

#define NRF54L_SIG_SPIM20_DCX(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 64)
#define NRF54L_TXT_SPIM20_DCX     "SPIM/SPIS20.DCX only works on any pin on P1, P2.00"
#define NRF54L_SIG_SPIS20_DCX(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 64)
#define NRF54L_TXT_SPIS20_DCX     "SPIM/SPIS20.DCX only works on any pin on P1, P2.00"

#define NRF54L_SIG_TWIM20_SCL(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIM20_SCL     "TWIM/TWIS20.SCL only works on any pin on P1"
#define NRF54L_SIG_TWIS20_SCL(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIS20_SCL     "TWIM/TWIS20.SCL only works on any pin on P1"

#define NRF54L_SIG_TWIM20_SDA(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIM20_SDA     "TWIM/TWIS20.SDA only works on any pin on P1"
#define NRF54L_SIG_TWIS20_SDA(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIS20_SDA     "TWIM/TWIS20.SDA only works on any pin on P1"

#define NRF54L_SIG_UARTE20_TXD(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 66)
#define NRF54L_TXT_UARTE20_TXD     "UARTE20.TXD only works on any pin on P1, P2.02"

#define NRF54L_SIG_UARTE20_RXD(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 64)
#define NRF54L_TXT_UARTE20_RXD     "UARTE20.RXD only works on any pin on P1, P2.00"

#define NRF54L_SIG_UARTE20_CTS(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 68)
#define NRF54L_TXT_UARTE20_CTS     "UARTE20.CTS only works on any pin on P1, P2.04"

#define NRF54L_SIG_UARTE20_RTS(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 69)
#define NRF54L_TXT_UARTE20_RTS     "UARTE20.RTS only works on any pin on P1, P2.05"

#define NRF54L_SIG_SPIM21_SCK(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 70)
#define NRF54L_TXT_SPIM21_SCK     "SPIM/SPIS21.SCK only works on any pin on P1, P2.06"
#define NRF54L_SIG_SPIS21_SCK(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 70)
#define NRF54L_TXT_SPIS21_SCK     "SPIM/SPIS21.SCK only works on any pin on P1, P2.06"

#define NRF54L_SIG_SPIM21_SDO(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 72)
#define NRF54L_TXT_SPIM21_SDO     "SPIM/SPIS21.SDO only works on any pin on P1, P2.08"
#define NRF54L_SIG_SPIS21_SDO(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 72)
#define NRF54L_TXT_SPIS21_SDO     "SPIM/SPIS21.SDO only works on any pin on P1, P2.08"

#define NRF54L_SIG_SPIM21_SDI(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 73)
#define NRF54L_TXT_SPIM21_SDI     "SPIM/SPIS21.SDI only works on any pin on P1, P2.09"
#define NRF54L_SIG_SPIS21_SDI(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 73)
#define NRF54L_TXT_SPIS21_SDI     "SPIM/SPIS21.SDI only works on any pin on P1, P2.09"

#define NRF54L_SIG_SPIM21_CS(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 74)
#define NRF54L_TXT_SPIM21_CS     "SPIM/SPIS21.CS only works on any pin on P1, P2.10"
#define NRF54L_SIG_SPIS21_CS(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 74)
#define NRF54L_TXT_SPIS21_CS     "SPIM/SPIS21.CS only works on any pin on P1, P2.10"

#define NRF54L_SIG_SPIM21_DCX(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 71)
#define NRF54L_TXT_SPIM21_DCX     "SPIM/SPIS21.DCX only works on any pin on P1, P2.07"
#define NRF54L_SIG_SPIS21_DCX(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 71)
#define NRF54L_TXT_SPIS21_DCX     "SPIM/SPIS21.DCX only works on any pin on P1, P2.07"

#define NRF54L_SIG_TWIM21_SCL(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIM21_SCL     "TWIM/TWIS21.SCL only works on any pin on P1"
#define NRF54L_SIG_TWIS21_SCL(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIS21_SCL     "TWIM/TWIS21.SCL only works on any pin on P1"

#define NRF54L_SIG_TWIM21_SDA(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIM21_SDA     "TWIM/TWIS21.SDA only works on any pin on P1"
#define NRF54L_SIG_TWIS21_SDA(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIS21_SDA     "TWIM/TWIS21.SDA only works on any pin on P1"

#define NRF54L_SIG_UARTE21_TXD(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 72)
#define NRF54L_TXT_UARTE21_TXD     "UARTE21.TXD only works on any pin on P1, P2.08"

