chcbaram/baram-nrf54-arduino/nrf54l/cores/nrf54l/nrf54l_pinmap.h
#define NRF54L_SIG_UARTE21_RXD(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 71)
#define NRF54L_TXT_UARTE21_RXD     "UARTE21.RXD only works on any pin on P1, P2.07"

#define NRF54L_SIG_UARTE21_CTS(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 73)
#define NRF54L_TXT_UARTE21_CTS     "UARTE21.CTS only works on any pin on P1, P2.09"

#define NRF54L_SIG_UARTE21_RTS(p)  (NRF54L_PORT_OF(p) == 1 || (p) == 74)
#define NRF54L_TXT_UARTE21_RTS     "UARTE21.RTS only works on any pin on P1, P2.10"

#define NRF54L_SIG_SPIM22_SCK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_SPIM22_SCK     "SPIM/SPIS22.SCK only works on any pin on P1"
#define NRF54L_SIG_SPIS22_SCK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_SPIS22_SCK     "SPIM/SPIS22.SCK only works on any pin on P1"

#define NRF54L_SIG_SPIM22_SDO(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_SPIM22_SDO     "SPIM/SPIS22.SDO only works on any pin on P1"
#define NRF54L_SIG_SPIS22_SDO(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_SPIS22_SDO     "SPIM/SPIS22.SDO only works on any pin on P1"

#define NRF54L_SIG_SPIM22_SDI(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_SPIM22_SDI     "SPIM/SPIS22.SDI only works on any pin on P1"
#define NRF54L_SIG_SPIS22_SDI(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_SPIS22_SDI     "SPIM/SPIS22.SDI only works on any pin on P1"

#define NRF54L_SIG_SPIM22_CS(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_SPIM22_CS     "SPIM/SPIS22.CS only works on any pin on P1"
#define NRF54L_SIG_SPIS22_CS(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_SPIS22_CS     "SPIM/SPIS22.CS only works on any pin on P1"

#define NRF54L_SIG_SPIM22_DCX(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_SPIM22_DCX     "SPIM/SPIS22.DCX only works on any pin on P1"
#define NRF54L_SIG_SPIS22_DCX(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_SPIS22_DCX     "SPIM/SPIS22.DCX only works on any pin on P1"

#define NRF54L_SIG_TWIM22_SCL(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIM22_SCL     "TWIM/TWIS22.SCL only works on any pin on P1"
#define NRF54L_SIG_TWIS22_SCL(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIS22_SCL     "TWIM/TWIS22.SCL only works on any pin on P1"

#define NRF54L_SIG_TWIM22_SDA(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIM22_SDA     "TWIM/TWIS22.SDA only works on any pin on P1"
#define NRF54L_SIG_TWIS22_SDA(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_TWIS22_SDA     "TWIM/TWIS22.SDA only works on any pin on P1"

#define NRF54L_SIG_UARTE22_TXD(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_UARTE22_TXD     "UARTE22.TXD only works on any pin on P1"

#define NRF54L_SIG_UARTE22_RXD(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_UARTE22_RXD     "UARTE22.RXD only works on any pin on P1"

#define NRF54L_SIG_UARTE22_CTS(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_UARTE22_CTS     "UARTE22.CTS only works on any pin on P1"

#define NRF54L_SIG_UARTE22_RTS(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_UARTE22_RTS     "UARTE22.RTS only works on any pin on P1"

#define NRF54L_SIG_PDM20_CLK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PDM20_CLK     "PDM20.CLK only works on any pin on P1"

#define NRF54L_SIG_PDM20_DIN(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PDM20_DIN     "PDM20.DIN only works on any pin on P1"

#define NRF54L_SIG_PDM21_CLK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PDM21_CLK     "PDM21.CLK only works on any pin on P1"

#define NRF54L_SIG_PDM21_DIN(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PDM21_DIN     "PDM21.DIN only works on any pin on P1"

#define NRF54L_SIG_PWM20_CHAN_0(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM20_CHAN_0     "PWM20.CHAN[0] only works on any pin on P1"

#define NRF54L_SIG_PWM20_CHAN_1(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM20_CHAN_1     "PWM20.CHAN[1] only works on any pin on P1"

#define NRF54L_SIG_PWM20_CHAN_2(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM20_CHAN_2     "PWM20.CHAN[2] only works on any pin on P1"

#define NRF54L_SIG_PWM20_CHAN_3(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM20_CHAN_3     "PWM20.CHAN[3] only works on any pin on P1"

#define NRF54L_SIG_PWM21_CHAN_0(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM21_CHAN_0     "PWM21.CHAN[0] only works on any pin on P1"

#define NRF54L_SIG_PWM21_CHAN_1(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM21_CHAN_1     "PWM21.CHAN[1] only works on any pin on P1"

#define NRF54L_SIG_PWM21_CHAN_2(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM21_CHAN_2     "PWM21.CHAN[2] only works on any pin on P1"

#define NRF54L_SIG_PWM21_CHAN_3(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM21_CHAN_3     "PWM21.CHAN[3] only works on any pin on P1"

#define NRF54L_SIG_PWM22_CHAN_0(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM22_CHAN_0     "PWM22.CHAN[0] only works on any pin on P1"

#define NRF54L_SIG_PWM22_CHAN_1(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM22_CHAN_1     "PWM22.CHAN[1] only works on any pin on P1"

#define NRF54L_SIG_PWM22_CHAN_2(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM22_CHAN_2     "PWM22.CHAN[2] only works on any pin on P1"

#define NRF54L_SIG_PWM22_CHAN_3(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_PWM22_CHAN_3     "PWM22.CHAN[3] only works on any pin on P1"

#define NRF54L_SIG_SAADC_AIN0(p)  ((p) == 36)
#define NRF54L_TXT_SAADC_AIN0     "SAADC.AIN0 only works on P1.04"

#define NRF54L_SIG_SAADC_AIN1(p)  ((p) == 37)
#define NRF54L_TXT_SAADC_AIN1     "SAADC.AIN1 only works on P1.05"

#define NRF54L_SIG_SAADC_AIN2(p)  ((p) == 38)
#define NRF54L_TXT_SAADC_AIN2     "SAADC.AIN2 only works on P1.06"

#define NRF54L_SIG_SAADC_AIN3(p)  ((p) == 39)
#define NRF54L_TXT_SAADC_AIN3     "SAADC.AIN3 only works on P1.07"

#define NRF54L_SIG_SAADC_AIN4(p)  ((p) == 43)
#define NRF54L_TXT_SAADC_AIN4     "SAADC.AIN4 only works on P1.11"

#define NRF54L_SIG_SAADC_AIN5(p)  ((p) == 44)
#define NRF54L_TXT_SAADC_AIN5     "SAADC.AIN5 only works on P1.12"

#define NRF54L_SIG_SAADC_AIN6(p)  ((p) == 45)
#define NRF54L_TXT_SAADC_AIN6     "SAADC.AIN6 only works on P1.13"

