chcbaram/baram-nrf54-arduino/nrf54l/cores/nrf54l/nrf54l_pinmap.h
#define NRF54L_SIG_SAADC_AIN7(p)  ((p) == 46)
#define NRF54L_TXT_SAADC_AIN7     "SAADC.AIN7 only works on P1.14"

#define NRF54L_SIG_SAADC_EXTREF(p)  ((p) == 40)
#define NRF54L_TXT_SAADC_EXTREF     "SAADC.EXTREF only works on P1.08"

#define NRF54L_SIG_NFCT_NFC1(p)  ((p) == 34)
#define NRF54L_TXT_NFCT_NFC1     "NFCT.NFC1 only works on P1.02"

#define NRF54L_SIG_NFCT_NFC2(p)  ((p) == 35)
#define NRF54L_TXT_NFCT_NFC2     "NFCT.NFC2 only works on P1.03"

#define NRF54L_SIG_GPIOTE20_CHAN_0(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_GPIOTE20_CHAN_0     "GPIOTE20.CHAN[0] only works on any pin on P1"

#define NRF54L_SIG_GPIOTE20_CHAN_1(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_GPIOTE20_CHAN_1     "GPIOTE20.CHAN[1] only works on any pin on P1"

#define NRF54L_SIG_GPIOTE20_CHAN_2(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_GPIOTE20_CHAN_2     "GPIOTE20.CHAN[2] only works on any pin on P1"

#define NRF54L_SIG_GPIOTE20_CHAN_3(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_GPIOTE20_CHAN_3     "GPIOTE20.CHAN[3] only works on any pin on P1"

#define NRF54L_SIG_GPIOTE20_CHAN_4(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_GPIOTE20_CHAN_4     "GPIOTE20.CHAN[4] only works on any pin on P1"

#define NRF54L_SIG_GPIOTE20_CHAN_5(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_GPIOTE20_CHAN_5     "GPIOTE20.CHAN[5] only works on any pin on P1"

#define NRF54L_SIG_GPIOTE20_CHAN_6(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_GPIOTE20_CHAN_6     "GPIOTE20.CHAN[6] only works on any pin on P1"

#define NRF54L_SIG_GPIOTE20_CHAN_7(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_GPIOTE20_CHAN_7     "GPIOTE20.CHAN[7] only works on any pin on P1"

#define NRF54L_SIG_TAMPC_ASO_0(p)  ((p) == 36)
#define NRF54L_TXT_TAMPC_ASO_0     "TAMPC.ASO[0] only works on P1.04"

#define NRF54L_SIG_TAMPC_ASI_0(p)  ((p) == 37)
#define NRF54L_TXT_TAMPC_ASI_0     "TAMPC.ASI[0] only works on P1.05"

#define NRF54L_SIG_TAMPC_ASO_1(p)  ((p) == 38)
#define NRF54L_TXT_TAMPC_ASO_1     "TAMPC.ASO[1] only works on P1.06"

#define NRF54L_SIG_TAMPC_ASI_1(p)  ((p) == 39)
#define NRF54L_TXT_TAMPC_ASI_1     "TAMPC.ASI[1] only works on P1.07"

#define NRF54L_SIG_TAMPC_ASO_2(p)  ((p) == 41)
#define NRF54L_TXT_TAMPC_ASO_2     "TAMPC.ASO[2] only works on P1.09"

#define NRF54L_SIG_TAMPC_ASI_2(p)  ((p) == 42)
#define NRF54L_TXT_TAMPC_ASI_2     "TAMPC.ASI[2] only works on P1.10"

#define NRF54L_SIG_TAMPC_ASO_3(p)  ((p) == 43)
#define NRF54L_TXT_TAMPC_ASO_3     "TAMPC.ASO[3] only works on P1.11"

#define NRF54L_SIG_TAMPC_ASI_3(p)  ((p) == 44)
#define NRF54L_TXT_TAMPC_ASI_3     "TAMPC.ASI[3] only works on P1.12"

#define NRF54L_SIG_I2S20_SCK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_I2S20_SCK     "I2S20.SCK only works on any pin on P1"

#define NRF54L_SIG_I2S20_LRCK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_I2S20_LRCK     "I2S20.LRCK only works on any pin on P1"

#define NRF54L_SIG_I2S20_SDIN(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_I2S20_SDIN     "I2S20.SDIN only works on any pin on P1"

#define NRF54L_SIG_I2S20_SDOUT(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_I2S20_SDOUT     "I2S20.SDOUT only works on any pin on P1"

#define NRF54L_SIG_I2S20_MCK(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_I2S20_MCK     "I2S20.MCK only works on any pin on P1"

#define NRF54L_SIG_QDEC20_A(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC20_A     "QDEC20.A only works on any pin on P1"

#define NRF54L_SIG_QDEC20_B(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC20_B     "QDEC20.B only works on any pin on P1"

#define NRF54L_SIG_QDEC20_LED(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC20_LED     "QDEC20.LED only works on any pin on P1"

#define NRF54L_SIG_QDEC21_A(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC21_A     "QDEC21.A only works on any pin on P1"

#define NRF54L_SIG_QDEC21_B(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC21_B     "QDEC21.B only works on any pin on P1"

#define NRF54L_SIG_QDEC21_LED(p)  (NRF54L_PORT_OF(p) == 1)
#define NRF54L_TXT_QDEC21_LED     "QDEC21.LED only works on any pin on P1"

#define NRF54L_SIG_GRTC_PWM(p)  ((p) == 3)
#define NRF54L_TXT_GRTC_PWM     "GRTC.PWM only works on P0.03"

#define NRF54L_SIG_GRTC_LFCLKOUT(p)  ((p) == 4)
#define NRF54L_TXT_GRTC_LFCLKOUT     "GRTC.LFCLKOUT only works on P0.04"

#define NRF54L_SIG_GRTC_CLK16M(p)  ((p) == 40)
#define NRF54L_TXT_GRTC_CLK16M     "GRTC.CLK16M only works on P1.08"

#define NRF54L_SIG_SPIM30_SCK(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIM30_SCK     "SPIM/SPIS30.SCK only works on any pin on P0"
#define NRF54L_SIG_SPIS30_SCK(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIS30_SCK     "SPIM/SPIS30.SCK only works on any pin on P0"

#define NRF54L_SIG_SPIM30_SDO(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIM30_SDO     "SPIM/SPIS30.SDO only works on any pin on P0"
#define NRF54L_SIG_SPIS30_SDO(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIS30_SDO     "SPIM/SPIS30.SDO only works on any pin on P0"

#define NRF54L_SIG_SPIM30_SDI(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIM30_SDI     "SPIM/SPIS30.SDI only works on any pin on P0"
#define NRF54L_SIG_SPIS30_SDI(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIS30_SDI     "SPIM/SPIS30.SDI only works on any pin on P0"

#define NRF54L_SIG_SPIM30_CS(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIM30_CS     "SPIM/SPIS30.CS only works on any pin on P0"
#define NRF54L_SIG_SPIS30_CS(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIS30_CS     "SPIM/SPIS30.CS only works on any pin on P0"

#define NRF54L_SIG_SPIM30_DCX(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIM30_DCX     "SPIM/SPIS30.DCX only works on any pin on P0"
#define NRF54L_SIG_SPIS30_DCX(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_SPIS30_DCX     "SPIM/SPIS30.DCX only works on any pin on P0"

#define NRF54L_SIG_TWIM30_SCL(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_TWIM30_SCL     "TWIM/TWIS30.SCL only works on any pin on P0"
#define NRF54L_SIG_TWIS30_SCL(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_TWIS30_SCL     "TWIM/TWIS30.SCL only works on any pin on P0"

