chcbaram/baram-nrf54-arduino/nrf54l/cores/nrf54l/nrf54l_pinmap.h
#define NRF54L_SIG_TWIM30_SDA(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_TWIM30_SDA     "TWIM/TWIS30.SDA only works on any pin on P0"
#define NRF54L_SIG_TWIS30_SDA(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_TWIS30_SDA     "TWIM/TWIS30.SDA only works on any pin on P0"

#define NRF54L_SIG_UARTE30_TXD(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_UARTE30_TXD     "UARTE30.TXD only works on any pin on P0"

#define NRF54L_SIG_UARTE30_RXD(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_UARTE30_RXD     "UARTE30.RXD only works on any pin on P0"

#define NRF54L_SIG_UARTE30_CTS(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_UARTE30_CTS     "UARTE30.CTS only works on any pin on P0"

#define NRF54L_SIG_UARTE30_RTS(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_UARTE30_RTS     "UARTE30.RTS only works on any pin on P0"

#define NRF54L_SIG_GPIOTE30_CHAN_0(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_GPIOTE30_CHAN_0     "GPIOTE30.CHAN[0] only works on any pin on P0"

#define NRF54L_SIG_GPIOTE30_CHAN_1(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_GPIOTE30_CHAN_1     "GPIOTE30.CHAN[1] only works on any pin on P0"

#define NRF54L_SIG_GPIOTE30_CHAN_2(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_GPIOTE30_CHAN_2     "GPIOTE30.CHAN[2] only works on any pin on P0"

#define NRF54L_SIG_GPIOTE30_CHAN_3(p)  (NRF54L_PORT_OF(p) == 0)
#define NRF54L_TXT_GPIOTE30_CHAN_3     "GPIOTE30.CHAN[3] only works on any pin on P0"

#define NRF54L_SIG_LFXO_XL1(p)  ((p) == 32)
#define NRF54L_TXT_LFXO_XL1     "LFXO.XL1 only works on P1.00"

#define NRF54L_SIG_LFXO_XL2(p)  ((p) == 33)
#define NRF54L_TXT_LFXO_XL2     "LFXO.XL2 only works on P1.01"

#define NRF54L_SIG_sQSPI_SCK(p)  ((p) == 65)
#define NRF54L_TXT_sQSPI_SCK     "sQSPI.SCK only works on P2.01"

#define NRF54L_SIG_sQSPI_CSN(p)  ((p) == 69)
#define NRF54L_TXT_sQSPI_CSN     "sQSPI.CSN only works on P2.05"

#define NRF54L_SIG_sQSPI_D0(p)  ((p) == 66)
#define NRF54L_TXT_sQSPI_D0     "sQSPI.D0 only works on P2.02"

#define NRF54L_SIG_sQSPI_D1(p)  ((p) == 68)
#define NRF54L_TXT_sQSPI_D1     "sQSPI.D1 only works on P2.04"

#define NRF54L_SIG_sQSPI_D2(p)  ((p) == 67)
#define NRF54L_TXT_sQSPI_D2     "sQSPI.D2 only works on P2.03"

#define NRF54L_SIG_sQSPI_D3(p)  ((p) == 64)
#define NRF54L_TXT_sQSPI_D3     "sQSPI.D3 only works on P2.00"

#endif

#endif /* _NRF54L_PINMAP_H_ */
